@echo off
@echo =========================================================
@echo ======================   查杀端口  ======================
@echo =========================================================
:taskport
@echo.
@set/p port=请输入要查杀的端口号：
@echo.
@echo ---------------------------------------------------------
@echo.
netstat -ano|findstr %port%
@echo ---------------------------------------------------------
@set/p pid=请输入要kill的进程号,返回上一步请输入"y"：
if "%pid%"=="y" (
	@echo.
	goto taskport
) else taskkill  /F /PID %pid%
@echo.
goto taskport
:end
